// Резлазуйте матод, принимающий в качестве аргумента целочисленный массие и некоторое значение.
// Мотод ищет в массиве заданное значение и возвращает его индекс. При этом, например:
//
// 1. если длина массива меньше некоторого заданного минимума, метод возвращает -1, в качестве кода ошибки.
// 2. если искомый элемент не найден, метод вернет -2 в качестве кода ошибки.
// 3. если вместо массива пришел null, метод вернет -3
// 4. придумайте свои варианты исключительных ситуаций и верните соответствующие коды ошибок.
//
// Напишите метод, в котором резлизуйте взаимодействие с пользователем. То есть, этот метод запросит искомое число
// у пользователя, вызовет первый, обработает возвращенное значение и покажет читаемый результат пользователю.
// Например, если вернулся -2, пользователю выведется сообщение: "Искомый элемент не найден".

public class Task2 {

    private final static int MIN_LENGTH = 5;

    public static void main(String[] args) {

    }

    public static int findIndex(int value, int[] array) {
        if (array == null) return -3;

        if (array.length < MIN_LENGTH) {
            return -1;
        }
        for (int i = 0; i < array.length; i++) {
            if (value == array[i]) {
                return i;
            }

        }
        return -2;
    }
}
